-module(er_quote).

-export([create_table/0, add_quote/1, del_quote/1, get_quote/1]).

-define(TABLE_NAME, quotes).


%% ----------------------------------------------------
%%  Создание таблицы.
%% ----------------------------------------------------
create_table() ->
	ets:new(?TABLE_NAME, [set, named_table]).

%% ----------------------------------------------------
%%  Добавление котировки в таблицу.
%% ----------------------------------------------------
%% [{1432567800,5.00,5.25,4.75,4.75}]
%% [{1432654200,5.25,5.75,5.0,5.75}]
%% [{1432740600,4.25,4.5,4.25,4.5}]
%% ----------------------------------------------------
add_quote([{UnixSec1531, Open, High, Low, Close}]) ->
	case ets:insert(?TABLE_NAME, [{UnixSec1531, Open, High, Low, Close}]) of
		true -> {ok, "New quote has been successfully added to table!"};
		false -> {error, "The quote could not be added to table!"}
	end;
add_quote(_) ->
	{error, "The quote format is not valid!"}.

%% ----------------------------------------------------
%%  Удаление котировки из таблицы по таймстампу.
%% ----------------------------------------------------
del_quote(UnixSec1531) ->
	ets:delete(?TABLE_NAME, UnixSec1531).

%% ----------------------------------------------------
%%  Поиск котировки в таблице по таймстампу.
%% ----------------------------------------------------
get_quote(UnixSec1531) ->
	ets:lookup(?TABLE_NAME, UnixSec1531).

%% ----------------------------------------------------
%%  Преобразование даты в таймстамп.
%% ----------------------------------------------------
% date_to_UnixSec1531({Year, Month, Day}) ->
% 	.